Dentista/app/views/appointments/_form.html.erb

SELECT "doctors".* FROM "doctors"  ORDER BY "doctors"."name" ASC
---
    <%= f.label "Doctor"%><br>
    <%= f.collection_select :doctor_id, Doctor.order(:name),:id,:name, include_blank: true %>

SELECT "pets".* FROM "pets"  ORDER BY "pets"."name" ASC
---
    <%= f.label "Paciente" %><br>
    <%= f.collection_select :pet_id, Pet.order(:name),:id,:name, include_blank: true %>