Dentista/app/controllers/appointments_controller.rb

INSERT INTO "appointments" ("reason", "doctor_id", "pet_id", "appointment_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["reason", "sdf"], ["doctor_id", 1], ["pet_id", 1], ["appointment_date", "2016-03-04"], ["created_at", "2016-03-03 03:20:02.316916"], ["updated_at", "2016-03-03 03:20:02.316916"]]
---
  def create
	puts "===================="
    puts "#{appointment_params}"
	puts "===================="
    @appointment = Appointment.new(appointment_params)

    respond_to do |format|
      if @appointment.save

UPDATE "appointments" SET "reason" = ?, "pet_id" = ?, "updated_at" = ? WHERE "appointments"."id" = ?  [["reason", "Motivo desconocido"], ["pet_id", 2], ["updated_at", "2017-05-01 22:18:55.559516"], ["id", 7]]
---
  def update
    respond_to do |format|
      if @appointment.update(appointment_params)