Dentista/app/controllers/doctors_controller.rb

  def create
    @doctor = Doctor.new(doctor_params)

    respond_to do |format|
      if @doctor.save
---
INSERT INTO "doctors" ("name", "address", "city", "state", "zip", "certified_by", "experience", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @doctor.update(doctor_params)
---
UPDATE "doctors" SET "address" = ?, "updated_at" = ? WHERE "doctors"."id" = ?  [["address", "32131"], ["updated_at", "2017-05-01 21:54:16.835850"], ["id", 1]]

  def destroy
    @doctor.destroy
---
DELETE FROM "doctors" WHERE "doctors"."id" = ?  [["id", 3]]