Dentista/app/controllers/pets_controller.rb

INSERT INTO "pets" ("name", "breed", "age", "weight", "last_appointment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "elliot"], ["breed", "case"], ["age", 12], ["weight", 123], ["last_appointment", "02/2/2016"], ["created_at", "2016-03-02 08:25:05.457942"], ["updated_at", "2016-03-02 08:25:05.457942"]]
---
  def create
    @pet = Pet.new(pet_params)

    respond_to do |format|
      if @pet.save

UPDATE "pets" SET "name" = ?, "breed" = ?, "age" = ?, "weight" = ?, "last_appointment" = ?, "updated_at" = ? WHERE "pets"."id" = ?  [["name", "Jesus Deanda Oritz"], ["breed", "132131"], ["age", 183], ["weight", 100], ["last_appointment", "2012-03-20"], ["updated_at", "2017-05-01 22:09:22.013626"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @pet.update(pet_params)